app/views/groups/_group.html.erb

<li><%= link_to group.groupname, group_path(group) %></li>
---
SELECT "groups".* FROM "groups"