app/views/users/_my_group.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "roles" ON "groups"."id" = "roles"."group_id" WHERE "roles"."user_id" = ? AND (roles.role_type='member' OR roles.role_type='admin')  [["user_id", 1]]
---
<li><%= link_to my_group.groupname, group_path(my_group) %>