app/controllers/conversations_controller.rb

  def show
    if @user.id == params[:id]
      redirect_to convos_path
    end
    @profile_user = User.find(params[:id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_convo
    @user=current_user
    @convos = Conversation.where("(user_id_1 = #{current_user.id}) OR (user_id_2 = #{current_user.id})").pluck(:user_id_1,:user_id_2)
---
SELECT "conversations"."user_id_1", "conversations"."user_id_2" FROM "conversations" WHERE ((user_id_1 = 1) OR (user_id_2 = 1))