app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    @group = Group.new
    @groups = Group.all

INSERT INTO "groups" ("groupname", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?)  [["groupname", "testgroup"], ["created_at", 2017-02-28 14:39:04 UTC], ["updated_at", 2017-02-28 14:39:04 UTC], ["slug", "testgroup"]]
---
  def create
    @group = Group.new(group_params)
    if @group.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @message = Message.new
    @user=User.find(current_user.id) #sets default to "member"

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 6]]
---
  def destroy
    if @role=="admin"
      @group.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def modify
    #deactivate, add, ban, leave
    other_user=User.find(params[:user_id]) if !params[:user_id].nil?

SELECT  "groups".* FROM "groups" WHERE "groups"."slug" = ? LIMIT ?  [["slug", "melissa's-group"], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."user_id" = ? AND "roles"."group_id" = ? LIMIT ?  [["user_id", 4], ["group_id", 2], ["LIMIT", 1]]
---
    def set_group
      @group = Group.find_by(slug: params[:slug])
      role=Role.find_by(group_id: @group.id, user_id: current_user.id)