app/controllers/groups_controller.rb

INSERT INTO "roles" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 3], ["user_id", 4], ["created_at", 2017-02-28 15:56:20 UTC], ["updated_at", 2017-02-28 15:56:20 UTC]]
SELECT "groups"."id" FROM "groups"
---
  def show
    @group = Group.find_by(slug: params[:slug])
    @message = Message.new
    @role = Role.find_or_create_by(group_id: @group.id, user_id: current_user.id) #sets default to "member"
    @members = @group.get_members.pluck(:username)