app/controllers/registrations_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "melissa"], ["created_at", 2017-02-28 05:39:49 UTC], ["updated_at", 2017-02-28 05:39:49 UTC], ["password_digest", 0]]