app/controllers/sessions_controller.rb

  def create
    user = User.find_by(user_params)
---
SELECT  "users".* FROM "users" WHERE (r) LIMIT ?  [["LIMIT", 1]]